In [4]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'name' : 'John',
    'sex' : 'male',
    'age' : 22
}
john_s = pd.Series(data)
print(john_s)

name    John
sex     male
age       22
dtype: object

In [5]:
array = np.array([100, 200, 300])
pd.Series(array)

0    100
1    200
2    300
dtype: int64

In [7]:
array = np.array([100, 200, 300])
labels = ['a', 'b', 'c']
pd.Series(array, labels)

a    100
b    200
c    300
dtype: int64

In [8]:
data = {
    'name':'John',
    'sex':'male',
    'age':22
}
john_s = pd.Series(data)
print(john_s['age'])

22

In [10]:
import numpy as np
ndarray = np.random.randint(5, size=(5, 4))
pd.DataFrame(data=ndarray)

   0  1  2  3
0  4  0  4  1
1  3  2  3  2
2  0  3  3  3
3  2  1  3  4
4  0  2  2  2

In [12]:
columns = ['a', 'b', 'c', 'd']
index = np.arange(0, 50, 10)
pd.DataFrame(data=ndarray, index=index, columns=columns)

    a  b  c  d
0   4  0  4  1
10  3  2  3  2
20  0  3  3  3
30  2  1  3  4
40  0  2  2  2

In [13]:
data1 = {
    'name':'John',
    'sex':'male',
    'age':22
}
data2 = {
    'name':'Zack',
    'sex':'male',
    'age':30
}
data3 = {
    'name':'Emily',
    'sex':'female',
    'age':32
}
pd.DataFrame([data1, data2, data3])

    name     sex  age
0   John    male   22
1   Zack    male   30
2  Emily  female   32

In [16]:
data1 = {
    'name':'John',
    'sex':'male',
    'age':22
}
data2 = {
    'name':'Zack',
    'sex':'male',
    'age':30
}
data3 = {
    'name':'Emily',
    'sex':'female',
    'age':32
}
pd.DataFrame([data1, data2, data3])

    name     sex  age
0   John    male   22
1   Zack    male   30
2  Emily  female   32